"""- **scanner.py**：负责递归扫描、发现 EXE、统计进度和处理访问异常。不负责绘制界面。"""
import os
"""
啥也不管了，先import一个os库，要完成递归扫描.......我得思考一下，这个递归是个怎么递归呢？？？
进入主目录，然后扫描有多少个子目录
进入子目录，判断是否存在子目录.......等一下，这个模式很像数据结构里学到的二叉树，关于二叉树的前序遍历，中序遍历，后序遍历
可惜的是我忘了这是具体怎么做的......我得思考一下.......
先看有没有子目录，判断是否有子目录
如果有子目录，进入子目录，进入子目录
进入子目录判断是否有子目录，若有，则重复操作进入子目录
若没有，则进行扫描，看看有咩有以exe作为后缀名的文件（如果隐藏了后缀名会影响吗？不太确定
扫描完成后返回上级目录
返回上级目录.........如果重复这个递归操作，就会出问题，会反复进入第一个目录
正确的做法是每次进入目录时候创建一个列表，之后取一个计数器，那么目录一旦变多就会导致计数器内层循环套内层循环....
这该怎么办呢.......目录里面不断套目录，本质其实有点像C语言的多维数组，多维数组.....那就好麻烦
似乎没有一个合格的算法能解决这个问题？？？？
让我想想......
哦吼被GPT点醒了
刚刚正在思考的本质不就是DFS吗，也就是二叉树讲的深度优先搜索
也就是说应该这样：（递归示例
------------------------------------------目录
-----------------还有目录吗？如果有则进入
-----------------没有则进行一次扫描，看看exe
------------------------------------没有目录进返回上一个目录
------------------------------------也只能这样了，如何使得自己不进入已经进入的目录？still a problem
"""
"""动手先试试写一下这个递归函数吧"""
def recursion_visit(file_path,exe_path=None):
    """这个首先得需要用户传进来文件的目录，也就是path"""
    """原先在写这个函数的时候，我们直接令exe_path=[]
    创造了一个空的列表，但是这就会导致一个问题，试着想一下这个情景
    第一次寻找-----exe[path]
    第二次寻找-----exe[path]+exe[path]
    exe[path]会出现两次？其实解决方法也很简单，不保存exe[path]就可以了？但是那样可能无法写进数据库里啊，没有数据怎么写到数据库里？
    那么直接令exe_path=None呢？如果exe[path]等于none的话，就创建一个新的列表exe_path=[]
    每一次递归都会传进来，最后写入的时候都是在这个列表里进行写入？？？？
    原来如此，我明白了!python的def指令会在执行的时候把右侧的括号算出来传进去也就是说
    如果我写def XXX(exe_path)
    第一次确实创建了exe_path[]，但是，第一次调用后这个列表并不是空列表
    而python在以后执行def的时候，发现exe_path[]已经存在，就会直接把它传进来，此时的exe_path=[]已经包含过一次数据了
    """
    if exe_path is None:
        exe_path = []
    if not os.path.exists(file_path):
        print("出现错误，请至少选择一个目录")
        return False
    else:
        print(f"正在{file_path}中进行查找")
        """告诉用户正在查，然后应该分一下，检查当前目录是否还有目录，之后设置两个变量，一个变量为当前文件夹的名字，另一个应该设置成列表
        记录当前文件夹的子目录的名字，如果没有则令其等于0
        如果有，则进入这个文件夹，更改第一个变量，然后查询当前目录还有没有子目录，有则设置计数器为n"""
        """我就说我是神，睡了一觉虽然只有六个小时但是一瞬间我就顿悟了DFS
        外层是一个for循环，设置计数器item，item会不断加，然后如果是新的文件夹，就会嵌套出一个内循环，由于for循环导致item不断的自加，所以根本不需要担心返回父级目录后会重复进入一个子级目录
        让我们开始吧let's gooooooo~~~~"""
        ##################################################################分割线
        for item in os.listdir(file_path):
            full_path = os.path.join(file_path, item)
            """这里有个小细节，一个变量就应该去负责一件事情，如果负责的太多，就会出现像之前的问题，一旦会出现逻辑的错误
            这里创造一个新的变量full_path，让full_path去承担担任递归的文件夹变量
            file_path相当于文件的根目录
            """
            if os.path.isdir(full_path):
                recursion_visit(full_path, exe_path)
            else:
                name, ext = os.path.splitext(full_path)
                if os.path.normcase(ext) == ".exe":
                    exe_path.append(full_path)

        print(f"扫完 {file_path}，目前累计 {len(exe_path)} 个 exe")
        return exe_path
if __name__ == "__main__":
    result = recursion_visit(r"D:\some_project\_tools")
    print(f"共 {len(result)} 条")